Revit.AnalysisDisplay.FaceAnalysisDisplay.GetElementAndRefPrimitiveIdFromTrace
Get the SpatialFieldManager PrimitiveId from Thread Local Storage
Returns:

Revit.AnalysisDisplay.FaceAnalysisDisplay.SetElementAndRefPrimitiveIdsForTrace(Autodesk.Revit.DB.Analysis.SpatialFieldManager,System.Collections.Generic.Dictionary{Autodesk.Revit.DB.Reference,System.Int32})
Set the SpatialFieldManager and PrimitiveId in Thread Local Storage
manager:
keyValues: